-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 18, 2025 at 06:09 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `productmanager`
--

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `price` decimal(10,2) NOT NULL,
  `stock` int(11) DEFAULT NULL,
  `image` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `product_id`, `name`, `description`, `price`, `stock`, `image`, `created_at`, `updated_at`) VALUES
(26, 1, 'আর রাহীকুল মাখতূম', 'আর রাহীকুল মাখতূম : একটি অনবদ্য সীরাত-গ্রন্থ। নবী কারীম সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের সীরাত পর্যালোচনায়, সীরাতের ঘটনামালার সুসংহত ও মনোজ্ঞ উপস্থাপনায় বক্ষ্যমাণ গ্রন্থটি সত্যিই এক নজিরবিহীন রচনা। আল কুরআনুল কারীম, হাদীসে নববী ও বিশুদ্ধ আছার এবং ঐতিহাসিক বর্ণনার নির্যাস বের করে প্রাজ্ঞ লেখক তাঁর এ বইটি সুবিন্যস্ত করেছেন।বইটি নির্ভরযোগ্যতার সর্বোচ্চ মানদণ্ড রক্ষা করে মহানবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের পবিত্র সীরাত উপস্থাপন করেছে, যা পাঠকের সামনে উজ্জ্বল করে দেয় সীরাতুল মুস্তাকীমের নিশানাসমগ্র। দেখিয়ে দেয় সীরাতুন্নাবী পাঠের সঠিক পদ্ধতি।', 780.00, 12, 'images/mgmZHehkmNMOpx1QJTu3x4FF36KngKrmmdFbO0dN.jpg', '2025-01-17 19:27:37', '2025-01-17 19:28:47'),
(27, 2, 'সিয়ারুস সাহাবা (১-১৭ খণ্ড)', '‘সিয়ারুস সাহাবা’ : ১৭ খণ্ডের পুরো সিরিজে উল্লেখ হয়েছে খাইরুল কুরুনের ৭৩২ জন মনীষীর জীবনী। এটিই বাংলা ভাষার সর্ববৃহৎ সাহাবি, তাবেয়ি, তাবে-তাবেয়ি বিশ্বকোষ। প্রায় ১০০ বছর আগে ‘দারুল মুসান্নিফিন : শিবলি একাডেমি’-এর ব্যবস্থাপনায় রচিত এই সিরিজটি গোটা বিশ্বে সমাদৃত।সিয়ারুস সাহাবায় উঠে এসেছে সাহাবায়ে কেরাম, তাবেয়ি ও তাবে-তাবেয়িদের পূর্ণাঙ্গ জীবনচিত্র। তাদের ইবাদাত, আখলাক, লেনদেন, যুদ্ধ ও বিজয়ের ইতিহাস, রাজনৈতিক-সামাজিক ও জ্ঞানতাত্ত্বিক জীবন, নতুন আঙ্গিকে তাহকিক ও তাখরিজের সাথে সবিস্তারে আলোচিত হয়েছে।', 11790.00, 5, 'images/2HPXct6HeFhT0kgoCQ08VwAyTnT57y0gs1dBNGKR.jpg', '2025-01-17 19:31:03', '2025-01-17 19:31:03'),
(28, 3, 'বৃষ্টিভেজা বিকেল', 'আমাদের জীবনের নানা দিকে, অজস্র গল্প ছড়িয়ে আছে। কত রঙের গল্প। কত ঢঙের গল্প। কিছু গল্প স্বপ্ন দেখায়। কিছু গল্প অশ্রু ঝড়ায়। আমাদের বদলে যাওয়ার গল্প। খণ্ড খণ্ড বেঁচে থাকার গল্প। কিছু গল্প ফেলে আসি অতীতে। এমন কিছু ছোট গল্প নিয়েই ‘বৃষ্টি ভেজা বিকেল।’ ঝিরিঝিরি বাতাসের সাথে এক পশলা বৃষ্টি হয়ে যাবার পরে প্রকৃতি যেমন শান্ত-স্নিগ্ধ পরিশুদ্ধতার রূপ ধারণ করে তেমনি ‘বৃষ্টিভেজা বিকেল’ বইটিও ইতিহাস,মোটিভেশনাল বিষয় নিয়ে আমাদের রাঙাবে ইনশা আল্লাহ।', 220.00, 25, 'images/vLTtkVaS0phw0pjWnyCB2PQY8P1waUOtYIwpWi42.jpg', '2025-01-17 19:34:01', '2025-01-17 19:34:01'),
(29, 4, 'ঈমান-আকীদা (২ খণ্ড)', 'আমাদের বিশ্বাস যে আকীদার ক্ষেত্রে কুরআন ও সুন্নাহর হুবুহ অনুসরণ এবং সাহাবী, তাবেয়ী, প্রসিদ্ধ চার ইমামের মতের বাইরে না যাওয়াই নাজাত ও প্রশান্তির পথ। প্রথম তিন মুবারাক যুগে যেসকল হাদিস পাওয়া যায় এবং যেসব হাদিস প্রসিদ্ধ আর হাদিস বিশারদদের দ্বারা সহীহ হিসেবে সাভ্যস্ত হয়েছে সেসবই বিশুদ্ধ আকীদার ক্ষেত্রে দলীলের মানদন্ড হওয়া উচিত। বাংলা ভাষার সাধারণ পাঠককের যারা ইসলামী আকীদার বিষয়ে জানতে আগ্রহী তাদের জন্য সহজ সাবলীলভাবে পাঠযোগ্য কিতাবের সংখ্যা খুব কমই বলা চলে। এক্ষেত্রে দেশের প্রখ্যাত আলেমে দ্বীন ড. খন্দকার আব্দুল্লাহ জাহাঙ্গীরের লেখা এই কিতাব এক অনন্য সংযোজন। কুরআন এবং সুন্নাহর আলোকে এই কিতাবে ইসলামী আকীদাকে ব্যাখ্যা করা হয়েছে যা সর্ব মহলে সমাদৃত। আশা করি তা বাংলা ভাষাভাষী পাঠকদেরকেও তাদের আকীদা বিষয়ক জিজ্ঞাসার উপযুক্ত জবাব আঞ্জাম দিতে সক্ষম হবে ইনশাআল্লাহ্‌।', 1200.00, 7, 'images/q0iiOocKrKSgrt9f1rRlAUeygTLBjWEjHuztzA5R.jpg', '2025-01-17 19:36:20', '2025-01-17 20:36:07'),
(30, 5, 'ফাতেমা বিনতে মুহাম্মাদ সা.', 'বলা হয়, মেয়েরা বাবার অনুগত হয়। সবচেয়ে বেশি ভালোবাসে বাবাকে। সে ভালোবাসার জোরেই ছোটো ফাতেমা রা.-এর অন্তর থেকে অত্যাচারীদের ভয় চলে গিয়েছিল একদিন। সেদিন অত্যাচারীরা তাঁর বাবাকে কাবা শরীফের সামনে অপমান করছিল। ঘাড়ের উপর উটের নাড়িভুঁড়ি রেখে দিয়েছিল। তখন এইটুকুন ছোট্ট ফাতেমা ভয়ে পালিয়ে যাননি; বরং অত্যাচারীদের সামনে অগ্নিমূর্তি ধারণ করেছিলেন। মক্কার মুশরিকদের সামনে যে অগ্নিঝড়া বক্তব্য দিয়েছিলেন; তা ইতিহাসে আজও অবিস্মরণীয় হয়ে আছে।বাবার সাথে তিন বছর বন্দি ছিলেন। ক্ষুধার জ্বালায় পাতা চিবিয়ে খেয়েছেন। একবারও বাবাকে অনুরোধ করেননি, ‘বাবা! কাফেরদের প্রস্তাব তুমি মেনে নাও, আর পারছি না। জীবন তো শেষ হয়ে যাচ্ছে।’ বরং বাবা যখন বিষণ্ণ থাকতেন তখন পাশে বসে মাথায় হাত বুলিয়ে দিতেন। বলতেন, ‘বাবা! আমরা একদিন বিজয়ী হবো ইনশা আল্লাহ।’', 230.00, 78, 'images/QCcRsGwqOIZTs2s2A9l5EXKIXdDkIVzWekMcKkXR.jpg', '2025-01-17 19:38:08', '2025-01-17 19:38:08'),
(31, 6, 'কুরআন থেকে নেওয়া জীবনের পাঠ', 'কুরআন কীভাবে আমাদের জীবনের কথা বলে, কীভাবে আমাদের জীবনে কুরআন হয়ে উঠতে পারে আলোর দিশা, কুরআনের আয়াতগুলো থেকে কীভাবে আমরা আহরণ করতে পারি মণি-মুক্তো, কীভাবে কুরআন আমাদের চিন্তার জগতে আনতে পারে নতুন মাত্রা— পাঠক পরিচিত হবে সেরকম একটা ধারার সাথে। উঁহু, গতানুগতিক গদ্য বা খটমটে প্রবন্ধ নয়, প্রতিটা অধ্যায়ে পাঠক দেখতে পাবে তার জীবনের প্রতিচ্ছবি, জীবন থেকে নেওয়া ঘটনা অথবা চারপাশের চিরচেনা জগতের সাথে কুরআন কীভাবে ওতপ্রোতভাবে সম্পর্কিত। জীবনের গল্প পড়তে পড়তে পাঠক ঢুকে পড়বে কুরআনের ভাবনার জগতে, সেই জগত থেকে আলো ধার করে পাঠক আবার ফিরে আসবে জীবনের ধারায়— ‘কুরআন থেকে নেওয়া জীবনের পাঠ’ বইটা সাজানো ঠিক এভাবেই, আলহামদুলিল্লাহ।', 330.00, 43, 'images/O5aGhTQFJOz9c3DJq4lvmuKHMDVwZAJ343fywQpB.jpg', '2025-01-17 19:39:44', '2025-01-17 19:39:44'),
(32, 7, 'প্যারাডক্সিক্যাল সাজিদ', 'বর্তমান যুগ হলো প্রেজেন্টাশানের যুগ। একটা জিনিসকে আপনি কিভাবে, কতোটা সহজে, কতোটা সাবলীলভাবে, কতোটা মাধুর্যতায় প্রেজেন্টেশান করছেন তার উপর কিন্তু অনেক কিছুই নির্ভর করে। ন্যাচারালি, মানুষের একটা স্বভাব হচ্ছে – এরা তত্ত্বকথা খুব কম হজম করতে পারে। এরা চায় সহজবোধ্যতা। প্যারাডক্সিক্যাল সাজিদ এর লেখক আরিফ আজাদ ঠিক এই পদ্ধতিই বেছে নিয়েছেন। তিনি গতানুগতিক লেকচার বা তত্বকথার ধাঁচে না গিয়ে, বক্তব্যের বিষয়গুলোকে গল্পের ধাঁচে ফেলে সাজিয়েছেন। প্রতিটি গল্পের শুরুতেই আছে মজার, আগ্রহ উদ্দীপক একটি সূচনা। কোথাও বা গল্পের কেন্দ্রীয় চরিত্র সাজিদের সাথে তাঁর বন্ধু আরিফের খুনসুটি, কোথাও বা মজার কোন স্মৃতির রোমন্থন, কোথাও বা আছে সিরিয়াস কোন ব্যাপারে সিরিয়াস কোন হুশিয়ারি। গল্পে মজা আছে, আনন্দ আছে। মোটামুটি, সার্থক গল্পে যা যা উপাদান থাকা দরকার, যা যা থাকলে পাঠকের গল্প পাঠে বিরক্তি আসেনা, রুচি হারায় না- তার সবকিছুর এক সম্মিলিত সন্নিবেশ যেন লেখক আরিফ আজাদের এই সিরিজের একেকটি এপিসোড।\r\nগল্পে গল্পে যুক্তি খন্ডন, পাল্টা যুক্তি ছুঁড়ে দেওয়া, পরম মমতায় অবিশ্বাসের অন্ধকার দূরীকরণে এ যেন এক বিশ্বস্ত শিল্পী।', 225.00, 25, 'images/D2Xa0qSOKoIdYHtg7uShPFci0ZKjh7mLtJ3APLEA.jpg', '2025-01-17 19:40:39', '2025-01-17 19:40:39'),
(33, 8, 'প্রত্যাবর্তন ২', 'তারা ডুবে ছিলেন ভোগবিলাসিতায়, প্রাচুর্য আর লোভ-লালসায়। গাড়ি, বাড়ি, অর্থকড়ি, সম্মান ও যশখ্যাতি—সবই ছিল তাদের জীবনে। ছিল না কেবল মানসিক প্রশান্তি। তাদের অন্তরে ছিল অন্তহীন এক অতৃপ্তি। কীসের যেন এক শূন্যতা। হৃদয়জুড়ে এক নীরব আর্তনাদ। দিনের পর দিন প্রার্থনায় লীন হয়েছেন তারা। সত্যকে খুঁজে পেতে কখনো দিনরাত গবেষণা, কখনো-বা করেছেন জ্ঞানীদের সাথে বৈঠক-আলোচনা।অবশেষে মহান আল্লাহর অশেষ করুণায় তাদের সামনে উন্মোচিত হয় এক আলোকিত পথ। সেই সাথে নেমে আসে কালবোশেখী ঝড়। লন্ডভন্ড হয়ে যায় তাদের এতদিনের সাজানো পৃথিবী। পাহাড়সম বাধা, কল্পনাতীত পরীক্ষা আর সীমাহীন যন্ত্রণা তাদের পথ আগলে দাঁড়ায়। তবু তারা সত্যের পথে অবিচল থাকে। আল্লাহকে ভালোবাসে তারা আঁকড়ে ধরে ইসলাম। খ্রিষ্টবাদ ছেড়ে ইসলামে আসা পাদরিদের এমনই অশ্রুভেজা, ঈমানদীপ্ত, বাস্তব সব ঘটনায় গড়ে উঠেছে আমাদের এবারের আয়োজন—‘প্রত্যাবর্তন ২.০’।', 330.00, 15, 'images/MnRRp2VRvfyCd3qwuXISGBKpwCbIfrEeYmwc0U9Y.jpg', '2025-01-17 19:43:24', '2025-01-17 19:43:24'),
(34, 9, 'জিজ্ঞাসা ও জবাব (১-৫ খণ্ড)', 'প্রশংসা আল্লাহর এবং সালাত ও সালাম আমাদের নবী মুহাম্মাদ সা. তাঁর পরিবারবর্গ ও সাহাবিদের উপর। ড. খোন্দকার আব্দুল্লাহ জাহাঙ্গীর রাহিমাহুল্লাহ তাঁর জীবদ্দশায় বিভিন্ন মাহফিলে ও টিভি চ্যানেলে বহু মানুষের যুগজিজ্ঞাসার জবাব কুরআন ও সুন্নাহর আলোকে প্রদান করেছেন। তাঁর একটি বিশেষ বৈশিষ্ট্য ছিল যে, তিনি মাহফিলগুলো ভিডিও ক্যাসেটবদ্ধ করতেন। ফলে তাঁর প্রশ্নোত্তর ও বক্তিতা যেমন সংরক্ষিত রয়েছে; তেমনি তা সংযোজন ও বিয়োজনের হাত থেকে রক্ষা পেয়েছে। তিনি তাঁর মৌলি রচনাগুলো যেমন তথ্যনির্ভর করে সাজিয়ে গেছেন, তেমনি তাঁর যুগজিজ্ঞাসার জবাবগুলোও কুরআন ও সহীহ হাদীসের আরোকে প্রদান করে গেছেন। বর্তমান জটিল জীবন ধারায় তাঁর প্রদত্ত বহু জিজ্ঞাসার জবাব মুসলিম অমুসলিম নির্বিশেষে সকলকে ইসলামের আলোর পথ দেখাবে বলে আমরা আশা রাখি।বিভিন্ন মাহফিলের বিডিও ক্যাসেট, টিভি চ্যানেল ও ইউটিউবে থাকা তাঁর প্রশ্নোত্তরমালা সংগ্রহ করে ‘‘জিজ্ঞাসা ও জবাব’’ নামে সিরিজ আকারে আস-সুন্নাহ পাবলিকেশন্স তা প্রকাশ করে আসছে। তারই ধারাবাহিকতায় ‘‘জিজ্ঞাসা ও জবাব ৫ম খণ্ড” বইটি প্রকাশ করেছে বলে আমরা মাহান আল্লাহুর দরবারে শুকরিয়া জানাই।', 1135.00, 5, 'images/C2rMaLQhNtzr3g8OKsc1PZGUCgQmesAIwtEJ5jjf.png', '2025-01-17 19:46:23', '2025-01-17 19:46:23'),
(35, 10, 'শায়খ আহমাদুল্লাহ প্যাকেজ', 'পরিকল্পিত যে কোনো কাজই সুন্দর ও সফল হয়। এবারের রমাদান তাকওয়া অর্জনের মাধ্যমে সার্থক করতে, আমল দিয়ে সাজাতে এবং জান্নাতের পথে এগিয়ে যেতে আস-সুন্নাহ ফাউন্ডেশন সাজিয়েছে রমাদানের সুনিপুণ পরিকল্পনার ছক ‘রমাদান প্ল্যানার’।\r\nএই প্লানারে রয়েছে রামাদ্বান মাসব্যাপী আত্মশুদ্ধি পূর্ণ পরিকল্পনা। প্ল্যানারটির উল্লেখযোগ্য কিছু অংশ হলো দিনের আয়াত, দিনের হাদিস, দিনের দুআ, দৈনিক চেকলিস্ট। এছাড়াও রয়েছে আল্লাহর গুণবাচক নাম ও প্রতিদিনের কাজ। ফলে পাঠক খুব সহজেই প্রতিদিন একটি করে কুরআনের আয়াত, একটি হাদিস এবং একটি করে দুআ মুখস্ত করতে পারবেন। কোন কাজটা কখন করবেন, পাঠক তার সময়ানুযায়ী খুব সহজেই তা ভাগ করে নিতে পারবেন। এছাড়া এতে রয়েছে সালাত ট্র্যাকার, কুরআন ট্র্যাকার, প্রতিদিনের প্রাপ্তি-অপ্রাপ্তিসমূহ ট্রাক করার সুযোগ সহ আরও অনেক কিছু।আসন্ন রামাদ্বানকে স্বার্থক করতে আজই অর্ডার করুন রামাদ্বান প্ল্যানার।', 350.00, 25, 'images/bmXUiOF0skUsgQd6Iod6yRKKOLSEnPp1ivcRFOOH.png', '2025-01-17 19:48:31', '2025-01-17 19:48:31');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `products_product_id_unique` (`product_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
